In [1]:
from poloniex import Poloniex

key = yourKey
secret = yourSecret
mysqllogin = your login details

In [2]:
polo = Poloniex(key,secret)

### Real Time Data
--------------------------

In [3]:
real_time = polo.returnOrderBook('BTC_LTC',depth=1)

In [4]:
real_time

{'asks': [['0.01660000', '18.38']],
 'bids': [['0.01657407', '29.52340634']],
 'isFrozen': '0',
 'seq': 183528260}

In [5]:
real_time['asks'][0][0]

'0.01660000'

In [6]:
type(real_time['asks'][0][0])

str

In [6]:
from sqlalchemy import create_engine
import pandas as pd

In [13]:
engine = create_engine(mysqllogin).connect()

# mysqllogin = "mysql//user:password@localhost/database_name"

In [11]:
customers = pd.read_sql_table('customers',con = engine ,index_col=  'customer_id')

customers

                name last_name area_id
customer_id
1               John     Smith     nw1
2            Patrick    Stuart     ne1
3            Gonzalo    Rearte     se2
4             Maria      Jones     sw3

In [12]:
areas = pd.read_sql_table('areas',con = engine ,index_col=  'area_id')

areas

              state         city
area_id
ne1           Maine     Portland
nw1      Washington      Seattle
se2         Florida        Miami
sw3      California  Los Angeles